/********************************************************************/
/* Description: AGTを用いたインターバルタイマの設定                    */
/* File: asrTimer.cpp                                               */
/* Date: 2024/08/18                                                 */
/* Author: Takashi YOSHIOKA                                         */
/********************************************************************/


/********************************************************************/
/* ヘッダファイルのインクルード                                        */
/********************************************************************/
#include <IRQManager.h>
#include "asrTimer.h"
#include "controlFunction.h"


/********************************************************************/
/* ソース内グローバルクラスの定義                                      */
/********************************************************************/
static GenericIrqCfg_t cfg;


/********************************************************************/
/* ソース内関数のプロトタイプ宣言                                      */
/********************************************************************/
static void MYISR_AGT2_INT(void);


/********************************************************************/
/* ASRスキャン割り込み関数の外部宣言                                   */
/********************************************************************/
extern void asr_scan(void);


/********************************************************************/
/* Description: AGTの初期化                                          */
/* Function: setup_asr_scan                                         */
/* Arguments: なし                                                  */
/* Return value: なし                                               */
/********************************************************************/
void setup_asr_scan(void)
{
  // モジュールストップ解除
  R_MSTP->MSTPCRD_b.MSTPD1 = 0;     // AGT2

  // AGTの設定
  R_AGT2->AGTCR_b.TSTART = 0;       // カウントストップ

  R_AGT2->AGTMR1_b.TMOD = 0b000;    // 0b000:タイマモード
  R_AGT2->AGTMR1_b.TCK = 0b001;     // 0b001:AGT clock = PCKB/8 = 6.25MHz
  R_AGT2->AGTMR2_b.LPM = 0;         // 0:通常モード
  R_AGT2->AGT = PERIOD_ASR_SET;
  
  // 割り込み設定
  cfg.irq = FSP_INVALID_VECTOR;     // 良く分からんが固定値
  cfg.ipl = 4;                      // 割り込み優先度 0(最高)-15(最低)
  cfg.event = ELC_EVENT_AGT2_INT;   // 割り込み要因としてAGT2アンダーフロー割り込みを指定
  IRQManager::getInstance().addGenericInterrupt(cfg, MYISR_AGT2_INT);   // 割り込み要因のセット
  
  R_AGT2->AGTCR_b.TSTART = 1;       // カウントスタート
}


/********************************************************************/
/* Description: 割り込みサービスルーチン(AGT2アンダーフロー割り込み)    */
/* Function: MYISR_AGT2_INT                                         */
/* Arguments: なし                                                  */
/* Return value: なし                                               */
/********************************************************************/
void MYISR_AGT2_INT(void)
{
  asr_scan();                       // ASRスキャン割り込み処理
  R_ICU->IELSR_b[cfg.irq].IR = 0;   // 割り込み要因フラグのクリア
}