/********************************************************************/
/* Description: DAC12を用いたアナログモニタの設定                     */
/* File: dacMonitor.h                                               */
/* Date: 2024/08/19                                                 */
/* Author: Takashi YOSHIOKA                                         */
/********************************************************************/


/********************************************************************/
/* 多重インクルード防止                                               */
/********************************************************************/
#ifndef _DACMONITOR_H_
#define _DACMONITOR_H_


/********************************************************************/
/* ヘッダファイルのインクルード                                       */
/********************************************************************/
#include <Arduino.h>


/********************************************************************/
/* 各種定数定義                                                      */
/********************************************************************/
static constexpr int16_t DACOUT_MAX =  2047;		// DAC出力の上限値
static constexpr int16_t DACOUT_MIN = -2048;		// DAC出力の下限値
static constexpr int16_t DACOUT_CEN = 2048;			// DAC出力の中央値

static constexpr uint16_t DACOUT_NUM = 2;			  // DAC出力チャネル数


/********************************************************************/
/* 外部公開関数のプロトタイプ宣言																		   */
/********************************************************************/
void setup_dac_monitor(void);
void set_dac_out(int16_t dacOutArg[]);


#endif /* END _DACMONITOR_H_ */