/********************************************************************/
/* Description: AGTを用いたインターバルタイマの設定                    */
/* File: sequenceTimer.h                                            */
/* Date: 2024/08/18                                                 */
/* Author: Takashi YOSHIOKA                                         */
/********************************************************************/


/********************************************************************/
/* 多重インクルード防止                                               */
/********************************************************************/
#ifndef _SEQUENCETIMER_H_
#define _SEQUENCETIMER_H_


/********************************************************************/
/* ヘッダファイルのインクルード                                       */
/********************************************************************/
#include <Arduino.h>
#include "motorVar.h"


/********************************************************************/
/* 各種定数定義                                                      */
/********************************************************************/
static constexpr uint16_t INT_AGT_SEQ_FREQ = 6250;    // インターバルタイマ クロック周波数 [kHz]

static constexpr uint16_t PERIOD_SEQ_SET = (uint16_t)((uint32_t)INT_AGT_SEQ_FREQ*PERIOD_SEQ/1000);   // シーケンス演算周期のカウント値換算


/********************************************************************/
/* 外部公開関数のプロトタイプ宣言																		   */
/********************************************************************/
void setup_sequence_scan(void);


#endif /* END _SEQUENCETIMER_H_ */