/********************************************************************/
/* Description: オペレータ入力状態に基づく状態遷移の実装                */
/* File: stateTransition.h                                          */
/* Date: 2024/08/18                                                 */
/* Author: Takashi YOSHIOKA                                         */
/********************************************************************/


/********************************************************************/
/* 多重インクルード防止                                               */
/********************************************************************/
#ifndef	_STATETRANSITION_H_
#define	_STATETRANSITION_H_


/********************************************************************/
/* ヘッダファイルのインクルード                                        */
/********************************************************************/
#include <Arduino.h>
#include "operator.h"


/********************************************************************/
/* 列挙型の定義                                                      */
/********************************************************************/
// インバータ運転状態型の定義
typedef enum
{
	stateStop = 0,
	stateRun,
	stateError,
	xStateNum
} invState_t;

// オペレータ入力イベント型の定義
typedef enum
{
	eventNone = 0,
	eventStop,
	eventRun,
	eventError,
	xEventNum
} oprEvent_t;


/********************************************************************/
/* 外部公開関数のプロトタイプ宣言																		   */
/********************************************************************/
invState_t update_state(invState_t invStateArg, oprSts_t *oprStsArg);


#endif	/* END _STATETRANSITION_H_ */